Ameba-AIoT/ameba-camera-sensor-driver/rtl8735_driver_code_sensor/source/lib_isp/rtstream/hardware/isp/hardware/include/regs/rts3915/isp_reg_mipiout.h
#define REG_MPLL_PI_PH_BITS 5
#define REG_MPLL_PI_PH_MASK (((1 << 5) - 1) << 8)
#define REG_MPLL_TESTEN_OFFSET 16
#define REG_MPLL_TESTEN_BITS 1
#define REG_MPLL_TESTEN_MASK (((1 << 1) - 1) << 16)
#define REG_OVERSHOOT_BP_OFFSET 24
#define REG_OVERSHOOT_BP_BITS 1
#define REG_OVERSHOOT_BP_MASK (((1 << 1) - 1) << 24)
/* MIPI_TX_APHY_CFG_8 0x0120 */
#define REG_PAD0_MODE_OFFSET 0
#define REG_PAD0_MODE_BITS 2
#define REG_PAD0_MODE_MASK (((1 << 2) - 1) << 0)
#define REG_PAD1_MODE_OFFSET 8
#define REG_PAD1_MODE_BITS 2
#define REG_PAD1_MODE_MASK (((1 << 2) - 1) << 8)
#define REG_PAD2_MODE_OFFSET 16
#define REG_PAD2_MODE_BITS 2
#define REG_PAD2_MODE_MASK (((1 << 2) - 1) << 16)
#define REG_PAD3_MODE_OFFSET 24
#define REG_PAD3_MODE_BITS 2
#define REG_PAD3_MODE_MASK (((1 << 2) - 1) << 24)
/* MIPI_TX_APHY_CFG_9 0x0124 */
#define REG_PAD4_MODE_OFFSET 0
#define REG_PAD4_MODE_BITS 2
#define REG_PAD4_MODE_MASK (((1 << 2) - 1) << 0)
#define REG_PAD_STR_OFFSET 8
#define REG_PAD_STR_BITS 1
#define REG_PAD_STR_MASK (((1 << 1) - 1) << 8)
#define REG_RANGE_MODE_OFFSET 16
#define REG_RANGE_MODE_BITS 1
#define REG_RANGE_MODE_MASK (((1 << 1) - 1) << 16)
#define REG_SR_CTRL_OFFSET 24
#define REG_SR_CTRL_BITS 2
#define REG_SR_CTRL_MASK (((1 << 2) - 1) << 24)
/* MIPI_TX_APHY_CFG_10 0x0128 */
#define REG_TXTST_EN_OFFSET 0
#define REG_TXTST_EN_BITS 1
#define REG_TXTST_EN_MASK (((1 << 1) - 1) << 0)
#define REG_TXTST_SEL_OFFSET 8
#define REG_TXTST_SEL_BITS 2
#define REG_TXTST_SEL_MASK (((1 << 2) - 1) << 8)
#define REG_TX_PRECUR_SEL_OFFSET 16
#define REG_TX_PRECUR_SEL_BITS 2
#define REG_TX_PRECUR_SEL_MASK (((1 << 2) - 1) << 16)
#define REG_TX_PRERES_SEL_OFFSET 24
#define REG_TX_PRERES_SEL_BITS 2
#define REG_TX_PRERES_SEL_MASK (((1 << 2) - 1) << 24)
/* MIPI_TX_APHY_CFG_11 0x012C */
#define REG_Z0_TX_OFFSET 0
#define REG_Z0_TX_BITS 4
#define REG_Z0_TX_MASK (((1 << 4) - 1) << 0)
/* MIPI_TX_APHY_CFG_12 0x0130 */
#define REG_PWDB_OFFSET 0
#define REG_PWDB_BITS 1
#define REG_PWDB_MASK (((1 << 1) - 1) << 0)

#endif /* _ISP_REG_MIPIOUT_H_INC_ */

